In [1]:
import pandas as pd

In [2]:
df_pop = pd.read_csv('../Database/world_population.csv')
df_pop

   Year   Total Population
0  1960         3034970564
1  1970         3684822701
2  1980         4436590356
3  1990         5282715991
4  2000         6115974486
5  2010         6924282937

# Pandas and Numpy

Pandas está integrado ao Numpy, por isso é possível fazer cálculos com algumas funções disponíveis em Numpy. Por exemplo: Soma, média e operações com os operadores universais (```+```, ```-```, ```*```, ```/```, ```**```, ```%```, etc).

In [3]:
df_pop.mean()

Year                 1.985000e+03
 Total Population    4.913226e+09
dtype: float64

In [4]:
"string1" + "string2"

'string1string2'

In [5]:
df_pop.sum()

Year                       11910
 Total Population    29479357035
dtype: int64

In [6]:
df_pop.std()

Year                 1.870829e+01
 Total Population    1.475905e+09
dtype: float64

In [7]:
df_pop.max()

Year                       2010
 Total Population    6924282937
dtype: int64

In [8]:
meu_dct = {
    "x": [1, None, 3, 4, None, 6, None, 8, None, 10],
    "x_quadrado": [1, None, 9, 16, 25, None, 49, 64, None, 100],
}

meu_df = pd.DataFrame(meu_dct)

In [9]:
meu_df

      x  x_quadrado
0   1.0         1.0
1   NaN         NaN
2   3.0         9.0
3   4.0        16.0
4   NaN        25.0
5   6.0         NaN
6   NaN        49.0
7   8.0        64.0
8   NaN         NaN
9  10.0       100.0

In [10]:
meu_df.dropna(how="all")

      x  x_quadrado
0   1.0         1.0
2   3.0         9.0
3   4.0        16.0
4   NaN        25.0
5   6.0         NaN
6   NaN        49.0
7   8.0        64.0
9  10.0       100.0

In [11]:
meu_df.fillna(-1)

      x  x_quadrado
0   1.0         1.0
1  -1.0        -1.0
2   3.0         9.0
3   4.0        16.0
4  -1.0        25.0
5   6.0        -1.0
6  -1.0        49.0
7   8.0        64.0
8  -1.0        -1.0
9  10.0       100.0

In [12]:
meu_df.fillna({"x": -5, "x_quadrado": -10})

      x  x_quadrado
0   1.0         1.0
1  -5.0       -10.0
2   3.0         9.0
3   4.0        16.0
4  -5.0        25.0
5   6.0       -10.0
6  -5.0        49.0
7   8.0        64.0
8  -5.0       -10.0
9  10.0       100.0

# Descrevendo um Dataframe

O método ```.describe``` calcula a frequência, os valores máximos, mínimos, médios, desvio padrão e os quartis de cada coluna de dados númericos.

In [13]:
df_baseball = pd.read_csv('../Database/baseball.csv')

In [14]:
df_baseball.head()

,Name,Team,Position,Height(inches),Weight(pounds),Age
0,Adam_Donachie,BAL,Catcher,74,180,22.90
1,Paul_Bako,BAL,Catcher,74,215,34.69
2,Ramon_Hernandez,BAL,Catcher,72,210,30.78
3,Kevin_Millar,BAL,First_Baseman,72,210,35.43
4,Chris_Gomez,BAL,First_Baseman,73,188,35.71

In [15]:
df_baseball.describe()

       Height(inches)  Weight(pounds)        Age
count       27.000000       27.000000  27.000000
mean        73.333333      195.814815  29.761481
std          2.572039       19.955792   4.511423
min         69.000000      160.000000  22.380000
25%         71.500000      182.500000  26.580000
50%         74.000000      189.000000  30.190000
75%         74.500000      210.000000  33.745000
max         79.000000      231.000000  36.690000

Também é possível visualizar percentils específicos.

In [16]:
df_baseball.describe(percentiles=[.16, .33, .66, .82])

       Height(inches)  Weight(pounds)        Age
count       27.000000       27.000000  27.000000
mean        73.333333      195.814815  29.761481
std          2.572039       19.955792   4.511423
min         69.000000      160.000000  22.380000
16%         71.000000      180.000000  24.180800
33%         72.580000      185.000000  27.764600
50%         74.000000      189.000000  30.190000
66%         74.000000      205.640000  31.352400
82%         75.320000      216.280000  34.811600
max         79.000000      231.000000  36.690000

## Contagem de Valores

In [17]:
df_baseball.head(2)

            Name  Team  Position  Height(inches)  Weight(pounds)    Age
0  Adam_Donachie   BAL   Catcher              74             180  22.90
1      Paul_Bako   BAL   Catcher              74             215  34.69

In [18]:
df_baseball["Position"].value_counts()

Position
Pitcher           12
Outfielder         6
Catcher            3
First_Baseman      2
Third_Baseman      2
Second_Baseman     1
Shortstop          1
Name: count, dtype: int64

In [19]:
df_baseball["Position"].value_counts(normalize=True)

Position
Pitcher           0.444444
Outfielder        0.222222
Catcher           0.111111
First_Baseman     0.074074
Third_Baseman     0.074074
Second_Baseman    0.037037
Shortstop         0.037037
Name: proportion, dtype: float64

In [20]:
df_baseball.isnull()

     Name   Team  Position  Height(inches)  Weight(pounds)    Age
0   False  False     False           False           False  False
1   False  False     False           False           False  False
2   False  False     False           False           False  False
3   False  False     False           False           False  False
4   False  False     False           False           False  False
5   False  False     False           False           False  False
6   False  False     False           False           False  False
7   False  False     False           False           False  False
8   False  False     False           False           False  False
9   False  False     False           False           False  False
10  False  False     False           False           False  False
11  False  False     False           False           False  False
12  False  False     False           False           False  False
13  False  False     False           False           False  False
14  False  False     False           False           False  False
15  False  False     False           False           False  False
16  False  False     False           False           False  False
17  False  False     False           False           False  False
18  False  False     False           False           False  False
19  False  False     False           False           False  False
20  False  False     False           False           False  False
21  False  False     False           False           False  False
22  False  False     False           False           False  False
23  False  False     False           False           False  False
24  False  False     False           False           False  False
25  False  False     False           False           False  False
26  False  False     False           False           False  False

In [21]:
df_baseball.loc[df_baseball["Weight(pounds)"].isnull()]

Empty DataFrame
Columns: [Name, Team, Position, Height(inches), Weight(pounds), Age]
Index: []

## Dados da Web

É possível importar dados de arquivos na web com pd.read_csv.

Obs.: No banco a necessidade de proxy limita essa funcionalidade, complicando um pouco mais o processo.

In [22]:
df = pd.read_csv('../Database/drinks.csv')

In [23]:
df.tail(2)

,country,beer_servings,wine_servings,total_litres_of_pure_alcohol,continent
190,Zambia,32,19,2.5,AF
191,Zimbabwe,64,18,4.7,AF

# Sort Values

Existem 2 métodos que podem ser usados para ordenar as linhas do dataframe.

   - sort_index: usado para ordenar as linhas pelos valores do index
   - sort_values: usado para ordenar as linhas pelos valores das colunas especificadas no parâmetro by

In [24]:
df.sort_index(axis=1)

,beer_servings,continent,country,total_litres_of_pure_alcohol,wine_servings
0,0,AS,Afghanistan,0.0,0
1,89,EU,Albania,4.9,54
2,25,AF,Algeria,0.7,14
3,245,EU,Andorra,12.4,312
4,217,AF,Angola,5.9,45
...,...,...,...,...,...
187,333,SA,Venezuela,7.7,3
188,111,AS,Vietnam,2.0,1
189,6,AS,Yemen,0.1,0
190,32,AF,Zambia,2.5,19
191,64,AF,Zimbabwe,4.7,18

In [25]:
df.sort_index()

,country,beer_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0.0,AS
1,Albania,89,54,4.9,EU
2,Algeria,25,14,0.7,AF
3,Andorra,245,312,12.4,EU
4,Angola,217,45,5.9,AF
...,...,...,...,...,...
187,Venezuela,333,3,7.7,SA
188,Vietnam,111,1,2.0,AS
189,Yemen,6,0,0.1,AS
190,Zambia,32,19,2.5,AF
191,Zimbabwe,64,18,4.7,AF

In [26]:
df.sort_values(by="beer_servings").sort_index()

,country,beer_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0.0,AS
1,Albania,89,54,4.9,EU
2,Algeria,25,14,0.7,AF
3,Andorra,245,312,12.4,EU
4,Angola,217,45,5.9,AF
...,...,...,...,...,...
187,Venezuela,333,3,7.7,SA
188,Vietnam,111,1,2.0,AS
189,Yemen,6,0,0.1,AS
190,Zambia,32,19,2.5,AF
191,Zimbabwe,64,18,4.7,AF

In [27]:
df.sort_index(axis=0, ascending=False)

,country,beer_servings,wine_servings,total_litres_of_pure_alcohol,continent
191,Zimbabwe,64,18,4.7,AF
190,Zambia,32,19,2.5,AF
189,Yemen,6,0,0.1,AS
188,Vietnam,111,1,2.0,AS
187,Venezuela,333,3,7.7,SA
...,...,...,...,...,...
4,Angola,217,45,5.9,AF
3,Andorra,245,312,12.4,EU
2,Algeria,25,14,0.7,AF
1,Albania,89,54,4.9,EU
0,Afghanistan,0,0,0.0,AS

In [28]:
df.sort_values(by="beer_servings")

,country,beer_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0.0,AS
158,South Sudan,0,0,2.2,AF
156,Somalia,0,0,0.0,AF
147,Saudi Arabia,0,0,0.1,AS
145,San Marino,0,0,0.0,EU
...,...,...,...,...,...
133,Poland,343,56,10.9,EU
63,Germany,346,175,11.3,EU
60,Gabon,347,59,8.9,AF
44,Czech Republic,361,134,11.8,EU
115,Namibia,376,1,6.8,AF

In [29]:
df.loc[40]

country                         Costa Rica
beer_servings                          149
wine_servings                           11
total_litres_of_pure_alcohol           4.4
continent                              NaN
Name: 40, dtype: object

In [30]:
df.sort_values(by="beer_servings").reset_index()

,index,country,beer_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,0,Afghanistan,0,0,0.0,AS
1,158,South Sudan,0,0,2.2,AF
2,156,Somalia,0,0,0.0,AF
3,147,Saudi Arabia,0,0,0.1,AS
4,145,San Marino,0,0,0.0,EU
...,...,...,...,...,...,...
187,133,Poland,343,56,10.9,EU
188,63,Germany,346,175,11.3,EU
189,60,Gabon,347,59,8.9,AF
190,44,Czech Republic,361,134,11.8,EU
191,115,Namibia,376,1,6.8,AF

In [31]:
df.sort_values(by="beer_servings").reset_index(drop=True)

,country,beer_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0.0,AS
1,South Sudan,0,0,2.2,AF
2,Somalia,0,0,0.0,AF
3,Saudi Arabia,0,0,0.1,AS
4,San Marino,0,0,0.0,EU
...,...,...,...,...,...
187,Poland,343,56,10.9,EU
188,Germany,346,175,11.3,EU
189,Gabon,347,59,8.9,AF
190,Czech Republic,361,134,11.8,EU
191,Namibia,376,1,6.8,AF

## Sample

Crie uma amostra das linhas do dataframe.

In [32]:
df.sample(n=5)

,country,beer_servings,wine_servings,total_litres_of_pure_alcohol,continent
107,Mexico,238,5,5.5,NaN
190,Zambia,32,19,2.5,AF
135,Qatar,1,7,0.9,AS
23,Brazil,245,16,7.2,SA
96,Lithuania,343,56,12.9,EU

Note que, cada vez que a função é chamada, sempre serão linhas **diferentes.**

In [33]:
df.sample(n=5, random_state=61658)

,country,beer_servings,wine_servings,total_litres_of_pure_alcohol,continent
11,Bahamas,122,51,6.3,NaN
28,Cote d'Ivoire,37,7,4.0,AF
3,Andorra,245,312,12.4,EU
140,Rwanda,43,0,6.8,AF
38,Comoros,1,4,0.1,AF

In [34]:
df.sample(frac=0.1, random_state=42)

,country,beer_servings,wine_servings,total_litres_of_pure_alcohol,continent
45,DR Congo,32,1,2.3,AF
136,South Korea,140,16,9.8,AS
76,Indonesia,5,0,0.1,AS
143,St. Vincent & the Grenadines,120,11,6.3,NaN
113,Mozambique,47,5,1.3,AF
177,Tuvalu,6,9,1.0,OC
15,Belarus,142,42,14.4,EU
18,Benin,34,13,1.1,AF
16,Belgium,295,212,10.5,EU
9,Austria,279,191,9.7,EU
78,Iraq,9,0,0.2,AS
112,Morocco,12,10,0.5,AF
66,Grenada,199,84,11.9,NaN
65,Greece,133,218,8.3,EU
153,Slovakia,196,116,11.4,EU
30,Cambodia,57,1,2.2,AS
145,San Marino,0,0,0.0,EU
69,Guinea-Bissau,28,21,2.5,AF
111,Montenegro,31,128,4.9,EU